Enums/ТипОперацииАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипОперацииАктивов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пополнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИзменениеСтоимостиАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеСтоимостиАктива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенег</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиВалюты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипОперацииАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/АвтоПополнениеАктива/Ext/Module.bsl
// Создает и проводит документ изменения стоимости актива "Т-банк инвестокопилка" с пополнением на 300 единиц
Процедура  СоздатьИПровестиЕжедневныйДокумент() Экспорт
	НовыйДок = Документы.ИзменениеСтоимостиАктива.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Актив = Константы.ОсновнойАктивДляАвтопополнения.Получить();
	ЗаполнитьПоАктиву.ЗаполнитьПоАктиву(НовыйДок);
	НовыйДок.ТипИзменения = Перечисления.ТипОперацииАктивов.Пополнение;
	НовыйДок.НоваяЦена = НовыйДок.ТекущаяСтоимость + 300;
	Попытка 
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
		ЗаписьЖурналаРегистрации("ЕжедневноеСозданиеДокумента", УровеньЖурналаРегистрации.Информация,,, "Документ создан успешно:"  + НовыйДок.Ссылка);
	Исключение
		ЗаписьЖурналаРегистрации("ЕжедневноеСозданиеДокумента", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
	КонецПроцедуры
